{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%pip install python-dotenv -q\n",
    "%pip install SPARQLWrapper -q\n",
    "%pip install pandas -q\n",
    "%pip install neo4j -q"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "sparql = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "sparql.addCustomHttpHeader('User-Agent', 'CoolBot/0.0 (https://example.org/coolbot/; coolbot@example.org)')\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Exploring data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Mars\tRoman god of war, guardian of agriculture\n",
      "\thttp://www.wikidata.org/entity/Q198\n",
      "\thttp://www.wikidata.org/entity/Q11451\n",
      "Ceres\tRoman goddess of agriculture\n",
      "\thttp://www.wikidata.org/entity/Q11451\n",
      "\thttp://www.wikidata.org/entity/Q964401\n",
      "\thttp://www.wikidata.org/entity/Q1956046\n",
      "\thttp://www.wikidata.org/entity/Q2995529\n",
      "Gaia\tGreek primordial deity, the personification of the Earth\n",
      "\thttp://www.wikidata.org/entity/Q964401\n",
      "Juno\tancient Roman goddess\n",
      "\thttp://www.wikidata.org/entity/Q8445\n",
      "\thttp://www.wikidata.org/entity/Q42008\n",
      "\thttp://www.wikidata.org/entity/Q866081\n",
      "\thttp://www.wikidata.org/entity/Q14819852\n",
      "Minerva\tRoman goddess of wisdom and sponsor of arts, trade, and defense\n",
      "\thttp://www.wikidata.org/entity/Q37226\n",
      "\thttp://www.wikidata.org/entity/Q49757\n",
      "\thttp://www.wikidata.org/entity/Q1294787\n",
      "\thttp://www.wikidata.org/entity/Q43109919\n"
     ]
    }
   ],
   "source": [
    "# Fetch all romain deities with their domains\n",
    "#\n",
    "# P31 instance of\n",
    "# Q11688446 roman deity\n",
    "# P2925 domain of saint or deity\n",
    "sparql.setQuery(\"\"\"\n",
    "SELECT ?romainDeity ?romainDeityLabel ?romainDeityDescription (group_concat(?domainOfSaint;separator=\";\") as ?domainsOfSaint) {\n",
    "  ?romainDeity wdt:P31 wd:Q11688446;\n",
    "  wdt:P2925  ?domainOfSaint .\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
    "}\n",
    "GROUP BY ?romainDeity ?romainDeityLabel ?romainDeityDescription\n",
    "LIMIT 5\n",
    "\"\"\")\n",
    "\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "\n",
    "for row in results[\"results\"][\"bindings\"]:\n",
    "    title = row[\"romainDeityLabel\"][\"value\"]\n",
    "    if ('romainDeityDescription' in row):\n",
    "      title += \"\\t\" + row['romainDeityDescription']['value']\n",
    "    \n",
    "    print(title)    \n",
    "    domains = row['domainsOfSaint']['value'].split(';')    \n",
    "    if (domains):\n",
    "      for domain in domains:\n",
    "          print(\"\\t\" + domain)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Q167008\n",
      "Taionjin\n",
      "Ahura Mazda\n",
      "God the Father\n",
      "Zhongli Quan\n",
      "Abraxas\n",
      "Q402052\n",
      "Adramelech\n",
      "Apaliunas\n",
      "Agon\n",
      "Q637803\n",
      "Q660031\n",
      "Ogma\n",
      "Devi\n",
      "Q793294\n",
      "Palici\n",
      "Q891215\n",
      "Baal\n",
      "Iat\n",
      "Lü Dongbin\n",
      "Ji Gong\n",
      "Phra Phrom\n",
      "Ansa\n",
      "Li Jing\n",
      "Tara\n",
      "Asura\n",
      "Omoikane\n",
      "Billiken\n",
      "Qingshui\n",
      "Ilmarinen\n",
      "Lono\n",
      "Han Xiang\n",
      "Beelzebub\n",
      "Belphegor\n",
      "Angra Mainyu\n",
      "Dōsojin\n",
      "Nezha\n",
      "Abellio\n",
      "Lieu Hanh\n",
      "Ḫepat\n",
      "Ekeko\n",
      "Atarrabi\n",
      "Ugajin\n",
      "Bathala\n",
      "Sarruma\n",
      "Shinigami\n",
      "Popiel\n",
      "Hubal\n",
      "Maya death gods\n",
      "Lan Caihe\n",
      "Zhurong\n",
      "Immortal Woman He\n",
      "Yngvi\n",
      "Väinämöinen\n",
      "Hadad\n",
      "Soranus\n",
      "Maximón\n",
      "Ataegina\n",
      "Šauška\n",
      "Antenociticus\n",
      "Fascinus\n",
      "Anshar\n",
      "Istanu\n",
      "Kothar-wa-Khasis\n",
      "Aide\n",
      "Ennead\n",
      "Ullikummi\n",
      "Souls of Pe and Nekhen\n",
      "Lelwani\n",
      "Ame-no-tajikarao\n",
      "Juok\n",
      "Seven Lucky Gods\n",
      "Kitchen god\n",
      "deva\n",
      "Aphrodite Urania\n",
      "Nunbarsegunu\n",
      "Upelluri\n",
      "Barrex\n",
      "Uttu\n",
      "Agasaya\n",
      "Mahamayuri\n",
      "Kubaba\n",
      "L727946\n",
      "Elder Zhang Guo\n",
      "Zhang Yazi\n",
      "Mikogami\n",
      "Penarddun\n",
      "Trailokyavijaya\n",
      "Paraclete\n",
      "Bamapana\n",
      "King Father of the East\n",
      "Shahmaran\n",
      "Aillen\n",
      "Ai apaec\n",
      "Theispas\n",
      "Mór Muman\n",
      "Jesus Christ\n",
      "Juracán\n",
      "Pizamar\n",
      "Abgal\n"
     ]
    }
   ],
   "source": [
    "# Distinct domains of saint or deity (P2925) values\n",
    "#\n",
    "# P2925 domain of saint or deity\n",
    "sparql.setQuery(\"\"\"\n",
    "SELECT DISTINCT ?deity ?deityLabel\n",
    "WHERE \n",
    "{\n",
    "  ?deity wdt:P31 wd:Q178885 \n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
    "  # FILTER ( ?domain in ( wd:Q178885 ) )\n",
    "  \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\")\n",
    "\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "\n",
    "# print(results)\n",
    "\n",
    "for row in results[\"results\"][\"bindings\"]:\n",
    "    if ('deityLabel' not in row):\n",
    "      continue\n",
    "    \n",
    "    title = row['deityLabel']['value']\n",
    "    print(title)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "738\n"
     ]
    }
   ],
   "source": [
    "# Count domains of saint or deity (P2925) values\n",
    "#\n",
    "# P2925 domain of saint or deity\n",
    "sparql.setQuery(\"\"\"\n",
    "SELECT (count(DISTINCT ?value) as ?count)\n",
    "WHERE \n",
    "{\n",
    "  ?item wdt:P2925/wdt:P1629*/wd:Q178885* ?value\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
    "}\n",
    "\"\"\")\n",
    "\n",
    "sparql.setReturnFormat(JSON)\n",
    "domainsOfSaintOrDeity = sparql.query().convert()\n",
    "\n",
    "print(domainsOfSaintOrDeity['results']['bindings'][0]['count']['value'])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Fetch all war deities\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Mars: http://www.wikidata.org/entity/Q112\n",
      " - http://www.wikidata.org/entity/Q198\n",
      " - http://www.wikidata.org/entity/Q11451\n",
      "Ares: http://www.wikidata.org/entity/Q40901\n",
      " - http://www.wikidata.org/entity/Q198\n",
      "Horus: http://www.wikidata.org/entity/Q84122\n",
      " - http://www.wikidata.org/entity/Q527\n",
      " - http://www.wikidata.org/entity/Q11573140\n",
      "Minerva: http://www.wikidata.org/entity/Q126916\n",
      " - http://www.wikidata.org/entity/Q37226\n",
      " - http://www.wikidata.org/entity/Q49757\n",
      " - http://www.wikidata.org/entity/Q1294787\n",
      " - http://www.wikidata.org/entity/Q43109919\n",
      "Astarte: http://www.wikidata.org/entity/Q130274\n",
      " - http://www.wikidata.org/entity/Q198\n",
      " - http://www.wikidata.org/entity/Q964401\n",
      " - http://www.wikidata.org/entity/Q4042967\n",
      "Seth: http://www.wikidata.org/entity/Q131795\n",
      " - http://www.wikidata.org/entity/Q198\n",
      " - http://www.wikidata.org/entity/Q79871\n",
      " - http://www.wikidata.org/entity/Q124490\n",
      " - http://www.wikidata.org/entity/Q182878\n",
      " - http://www.wikidata.org/entity/Q473741\n",
      " - http://www.wikidata.org/entity/Q1787424\n",
      "Wadjet: http://www.wikidata.org/entity/Q146007\n",
      " - http://www.wikidata.org/entity/Q463871\n",
      "Tyr: http://www.wikidata.org/entity/Q172713\n",
      " - http://www.wikidata.org/entity/Q198\n",
      " - http://www.wikidata.org/entity/Q5167661\n",
      "Huitzilopochtli: http://www.wikidata.org/entity/Q219412\n",
      " - http://www.wikidata.org/entity/Q198\n",
      " - http://www.wikidata.org/entity/Q33741\n",
      "Erra: http://www.wikidata.org/entity/Q290861\n",
      " - http://www.wikidata.org/entity/Q1096108\n"
     ]
    }
   ],
   "source": [
    "# P31 instance of\n",
    "# Q41863069 war deity\n",
    "sparql.setQuery(\"\"\"\n",
    "SELECT ?wargod ?wargodLabel (group_concat(?domainOfSaint;separator=\";\") as ?domainsOfSaint) {\n",
    "  ?wargod wdt:P31 wd:Q41863069;\n",
    "  wdt:P2925  ?domainOfSaint\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
    "}\n",
    "GROUP BY ?wargod ?wargodLabel\n",
    "\"\"\")\n",
    "\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "\n",
    "print_limit = 10\n",
    "for row in results[\"results\"][\"bindings\"][:print_limit]:\n",
    "  print(row[\"wargodLabel\"][\"value\"] + \": \" + row[\"wargod\"]['value'])  \n",
    "  \n",
    "  domains = row['domainsOfSaint']['value'].split(';')    \n",
    "  if (domains):\n",
    "    for domain in domains:\n",
    "        print(\" - \" + domain)\n",
    "  "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from neo4j import GraphDatabase\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv()\n",
    "url = os.getenv('NEO4J_BOLT_URL')\n",
    "user = os.getenv('NEO4J_USERNAME')\n",
    "password = os.getenv('NEO4J_PASSWORD')\n",
    "\n",
    "driver = GraphDatabase.driver(url, auth=(user,password))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Delete all nodes & relationships\n",
    "with driver.session() as session:\n",
    "    session.run(\"MATCH (n) DETACH DELETE n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Fetch deities \n",
    "\n",
    "sparql.setQuery(\"\"\"\n",
    "SELECT  ?deity ?deityLabel ?parentDeity ?parentDeityLabel ?domainOfSaint ?domainOfSaintLabel ?deityOf ?deityOfLabel\n",
    "WHERE {\n",
    "  ?deity wdt:P31 ?parentDeity .                   # deites that are an instance of (P31) a parent deity\n",
    "  ?parentDeity wdt:P279 wd:Q178885  .             # parent deity that is a \"subclass of\" (P279) 'deity' (Q178885)\n",
    "  \n",
    "  ?deity p:P31 ?deity_instance .                  # instance_of (Pax is an instance of a Romain Deity)\n",
    "  OPTIONAL { ?deity_instance pq:P642 ?deityOf . }      # \"of\" attribute of the instance_of (Romain Deity OF peace)\n",
    "   \n",
    "  OPTIONAL { ?deity wdt:P2925  ?domainOfSaint . } # \"domain of saint or deity\" (P2925) (Mars is deity of War and Agriculture)\n",
    "\n",
    "  SERVICE wikibase:label {\n",
    "    bd:serviceParam wikibase:language \"en\" .\n",
    "  }\n",
    "}\n",
    "\"\"\")\n",
    "\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "\n",
    "with driver.session() as session:  \n",
    "\n",
    "  for row in results[\"results\"][\"bindings\"]:\n",
    "      # print(row[\"deityLabel\"][\"value\"] + \": \" + row[\"parentDeity\"]['value'])  \n",
    "      \n",
    "      session.run(\"MERGE (g:Deity { name: $name, entity: $entity}) RETURN g\", \n",
    "              name=row[\"deityLabel\"][\"value\"], \n",
    "              entity=row[\"deity\"]['value'])\n",
    "      \n",
    "      session.run(\"MERGE (d:Religion { name: $name, entity: $entity}) RETURN d\", \n",
    "                  name=row['parentDeityLabel']['value'],\n",
    "                  entity=row[\"parentDeity\"]['value'])\n",
    "      \n",
    "      session.run(\"MATCH (g2:Deity {entity: $deity_entity}), (d2:Religion {entity: $religion_entity}) MERGE (g2)-[r:PART_OF]->(d2)\",\n",
    "                  deity_entity=row[\"deity\"]['value'],\n",
    "                  religion_entity=row[\"parentDeity\"]['value'])      \n",
    "      \n",
    "      if (\"domainOfSaintLabel\" in row):\n",
    "        session.run(\"MERGE (d:Domain { name: $name, entity: $entity }) RETURN d\", \n",
    "                name=row[\"domainOfSaintLabel\"][\"value\"], \n",
    "                entity=row[\"domainOfSaint\"]['value'])\n",
    "\n",
    "        session.run(\"MATCH (g2:Deity {entity: $deity_entity}), (d2:Domain {entity: $domain_entity}) MERGE (g2)-[r:GOD_OF]->(d2)\",\n",
    "                    deity_entity=row[\"deity\"]['value'],\n",
    "                    domain_entity=row[\"domainOfSaint\"]['value'])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# with driver.session() as session:  \n",
    "#   for row in results[\"results\"][\"bindings\"]:\n",
    "#       # We want the \"value\" attribute of the \"comment\" field\n",
    "#       print(row[\"wargod\"]['value'] + \"\\t\" + row[\"wargodLabel\"][\"value\"])\n",
    "      \n",
    "#       session.run(\"CREATE (g:God { name: $name, entity: $entity}) RETURN g\", \n",
    "#                   name=row[\"wargodLabel\"][\"value\"], \n",
    "#                   entity=row[\"wargod\"]['value'])\n",
    "      \n",
    "#       domains = row['domainsOfSaint']['value'].split(';')    \n",
    "#       if (domains):\n",
    "#         for domain in domains:\n",
    "#             print(\"\\t\" + domain)\n",
    "            \n",
    "#             session.run(\"MERGE (d:Domain { entity: $entity}) RETURN d\", entity=domain)\n",
    "            \n",
    "              \n",
    "#             session.run(\"MATCH (g2:God {entity: $god_entity}), (d2:Domain {entity: $domain_entity}) MERGE (g2)-[r:GOD_OF]->(d2)\",\n",
    "#                         god_entity=row[\"wargod\"]['value'],\n",
    "#                         domain_entity=domain)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.6 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.6"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "916dbcbb3f70747c44a77c7bcd40155683ae19c65e1c03b4aa3499c5328201f1"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
